// switch


// напиши скрипт выбора стоимости отеля по количеству звезд
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
// Если в переменной stars что - то кроме чисел 1 - 5, выведи строку
// 'Такого количества звезд нет'

// const stars = 5;
// let price;
// if (stars === 1) {
//     price = 20;
// }
// else if (stars === 2) {
//     price = 30;
//  }
// else if (stars === 3) {
//     price = 50;
//  }
// else if (stars === 4) {
//     price = 70;
// }
//  else if (stars === 5) {
//     price = 120;
// }
// else {
//     console.log('Такого количества звезд нет');
// }
// console.log(price);

// переписываем на свич
// const stars = 5;
// let price;
// switch (stars) {
//     case 1:
//         price = 20;
//         break;
    
//      case 2:
//         price = 30;
//         break;
    
//     case 3:
//         price = 50;
//         break;
    
//     case 4:
//         price = 70;
//         break;
    
//     case 5:
//         price = 120;
//         break;
    
//     default:
//         console.log('Такого количества звезд нет');
// }
// console.log(price);

// const stars = 1;
// let price;
// if (stars === 1 || stars === 2) {
//     price = 20;
// }
// else if (stars === 3 || stars === 4) {
//     price = 30;
// }
// else if (stars === 5) {
//     price = 50;
// }
// else {
//     console.log('Такого количества звезд нет');
// }
// console.log(price);


// переписиваем на свич / только строгое равенство
// const stars = 3;
// let price;
// switch (stars) {
//     case 1:
//     case 2:
//         price = 20;
//         break;
//     case 3:
//     case 4:
//         price = 30;
//         break;
//     case 5:
//         price = 120;
//         break;
    
//     default:
//         console.log('Такого количества звезд нет');
// }
// console.log(price);


// ЗАДАЧА
// Напиши скрипт выбора опции доставки  товара.
// Опция хранится в переменной option: 1 - самовывоз, 2 - курьер, 3 - почта

// В переменную message записать сообщение в зависимости от опций
//     - Вы сможете забрать товар завтра с 12.00 в нашем офисе
//     - Курьер доставит заказ завтра с 9:00 до 18:00
//     - Посылка будет отправлена сегодня
//     - Вам перезвонит мернеджер

// 1. Сделать переменные
// const option = 3;
// let message = '';
// // 2. Сделать switch 1, 2, 3
// // 3. В каждом кейсе записать message строку
// switch (option) {
//     case 1:
//         message = 'Вы сможете забрать товар завтра с 12.00 в нашем офисе'
//         break;
//     case 2:
//         message = 'Курьер доставит заказ завтра с 9:00 до 18:00'
//         break;
//     case 3:
//         message = 'Посылка будет отправлена сегодня'
//         break;
//     default:
//         message = 'Вам перезвонит мернеджер';
// }
// // 4. сделать лог message
// console.log(message);

// __________________________________________________________________________

// const value = 4;
// if (value > 5) {
//     console.log('4>5');
// } else if(value > 6){
//     console.log('4>6');
// } else {
//     console.log('else');
// }

// const value = '';
// if (value) {//0=>false
//     console.log('if');
// } else {
//     console.log('else');
// }

// condition ? example 1 : example 2


// const result  5 > 6 ? 'більше' : 'меньше'
//                          true     false
// Присвой в результат виразу тернарного виразу, якщо 5 більше 6 то
//   присвой рядочок меньше, якщо все ж таки умова буде правдивлою,
//   отримаємо блок тру,більше
// let result;
// if (7 > 6) {
//     result = 'більше';
// } else {
//     result = 'меньше';
// }
// console.log(result);


// const result = 10 + 5;
// console.log(result);
// console.log(testValue);
// const value = 5;
// if (value === 1) {
    
// } else if (value === 2) {
    
// } else if (value === 2) {

// } else if (value === 5) {

// } else {
//     console.log('default');
// }

// switch (value) {
//     case 1:
//         console.log('one');
//         break;
//     case 2:
//         console.log('two');
//         break;
//     case 5:
//         console.log('Good result');
//         break;
//     default:
//         console.log('default');
// }
// _________________________________________________________________________
// області видимості - Де замкнена ваша змінна
// 1 Глобальна(повністю весь наш файл)
// 2 блочна У фігурних дужках
// 3 функціональна (в функції)

// блок це будь що замкнене в фігурні дужки

// const a = 15;
// if (true) {
//     console.log(a);
// }
// if (true) {
//     const b = 22;
// }
// console.log(b); //b is not defined- можемо з середини підніматися на зовні

// const a = 15;
// if (true) {
//     console.log(a);
// }
// if (true) {
//     var b = 22;
// }
// console.log(b); //var можна витянути за межі блока, якщо буде в функції
// то буде писати помилку. Функціонал додптково блокує

// Приклад 1
// let a = 15;     //якщо тру то ми змінну перевизначаємо з 15 на 25
// if (true) {     //якщо false то оголошена змінна залишається 15
//     a = 25;
// }
// console.log(a);

// Приклад 2
// let a = 15;     //15 -змінна не побачить що віббувається в блоці
// if (true) {     //тому залишить попередні дані
//     //блочна змінна
//    let a = 1;
//     a = 25;
// }
// console.log(a);

// Приклад 3
// let a = 15;     //глобальна змінна
// if (true) {     //після оголошення глобальної не мложна переоголошувати
//     //блочна змінна
//     a = 25;
//    let a = 1;
// }
// console.log(a);


// let a = 10;
//оголосили глоб змінну, ідемо в іф, оголошенна змінна а,

// if (true) {
//     let a = 15;
//     if (true) {            //10
//         a = 25;
//     }
// }
// console.log(a);

// if (true) {
//     let a = 15;
//     if (true) {            //25
//         a = 25;
//     }
//     console.log(a);
// }

// if (true) {
//      a = 15;
//     if (true) {            //25
//         a = 25;
//     }
// }
// console.log(a);

// let a = 15;

// if (true) {
//      a = 15;
//     if (true) {            //15
//        let a = 25;
//     }
// }
// console.log(a);


// let b = 25;
// if (true) {
//     let a = 15;
//     b = 44;
//     if (true) {            //31
//         a = 25;            //a is not defined
//         b = 31;
//     }
//     a = 44;
//     console.log(b);
// }
// console.log(a);

// ____________________________________________________________________
// ЦИКЛИ
// for (let i = 0; i < 5; i += 1){
//     console.log(i);
// }
// порядковий номер 123456
// const str = 'Hello world';
// // індекс 012345
// for (let i = 0; i < str.length; i += 1){
//     console.log(str[i]); //0123456
// }

// while (true){
//     console.log('Hello world');
// }

// const str = 'hello world';
// let i = 0;
// do {
//     if (str[i] === 'w') {
//         console.log('yes');
//         break;
//     }
//     console.log('no');
//     i += 1;
    
// } while (i < str.length);

// let i = 0;
// while (i < str.length) {
//     if (str[i] === 'w'){
//         console.log('yes');
//         break;
//     }
//     console.log('no', str[i]);
//     i += 1;
// }

// _________________________________________________________________________




// Цикл For(один кусочек вывести произвольное количество раз)
// 1 класический
// for (let i = 0; i < 25; i+=1) {
//     console.log(i);
// }
// console.log('bvfvnjvn');
// 2
// for (let i = 10; i >= 0; i-=2) {
//     console.log(i);
// }
// console.log('bvfvnjvn');
// 3
// for (let i = 0; i < 40; i+=3) {
//    console.log(i);
// }


// Задача 2
// Напиши скрипт который подсчитывает общую сумму зарплат работников
//     *  количество работников хранится в переменной employees
//     *  зарплата каждого это случайное число от 500 до 5000
//     * записать сумму в переменную totalSalary и вывести в консоль
//         * /
// Решение
// 1 Сделать переменные
// const minSalary = 500;
// const maxSalary = 5000;
// const employees = 8;
// let totalSalary = 0;
// // 2 перебрать работников в цикле
// // 3 сгенерить случайную ЗП
// // 4 прибавить к ТОТАЛУ
// // 5 лог
// for (let i = 1; i <= employees; i += 1) {
//     const salary = Math.round(
//         Math.random() * (maxSalary - minSalary) + minSalary
//     )
//     console.log(`ЗП работника номер  ${i} - ${salary}`);
//     totalSalary += salary;
//     // console.log('totalSalary: ', totalSalary);
    
// }

// console.log('totalSalary: ', totalSalary);


// Задача 3
// Напиши скрипт который подсчитывает сумму всех четных чисел,
// которые входят в диапазон чисел в переменных от min до maх,
// Например если min = 0 и max = 5, то диапазон от 0 - 5, и в нем два четных числа - 2 и 4
// их сумма 6.
// const min = 10;
// const max = 50;
// let total = 0;

// фор с шагом от мын до макс с шагом в 1
// проверяем остаток от деления
// пишем сумму
// for (let i = min; i <= max; i+=1) {
//     // console.log(i);
//     if (i % 2 === 0) {
//         console.log('Четное:', i);
//         total += i;
//     }
// }
// console.log('total: ', total);

// логика от обратного если не равно, пропускай
// for (let i = min; i <= max; i+=1) {
//     if (i % 2 !== 0) {
//         console.log('Не четное:', i);
//         continue;
//     }
//     console.log('Четное:', i);
//         total += i;
// }
// console.log('total: ', total);





// Задача 4
// Напиши скрипт обработки покувпки в магазине
// - Баланс пользователя хранится в переменной balance
// - сумма покупки хранится в переменной payment
// - Перед проверкой вывести сообщение:
// "Общая стоимость заказа [число] кредитов.
// Проверяем количество доступных средств на счету"
// - Если сумма покупки не превышает баланс:
//     * вычесть из баланса сумму покупки
//     * Вывести сообщение "На счету осталось [число] кредитов"
// - Если сумма покупки превышает баланс:
//     * Вывести сообщение "На счету недостаточно средств для проведения операции!"
// -В конце вывести сообщение "Операция завершена"
// "Всё хорошо, снимаем деньги за покупку"
// let balance = 10000;
// const payment = 5000;
// console.log(`Общая стоимость заказа ${payment} кредитов.
// Проверяем количество доступных средств на счету`,
// );
// if (balance >= payment) {
//     console.log('OK');
//     balance -= payment;
//     // balance = balance-payment
//     console.log('Все хорошо, снимаем деньги за покупку!');
//     console.log(`На счету осталось ${balance} кредитов`);
// }
// else {
//     console.log('На счету недостаточно средств для проведения операции!');
// }
// console.log('Операция завершена');



// Задача 5
// Напиши скрипт подсчета суммі покупки со скидкой в зависимости
// от потраченой суммі за все время(партнерская программа)

//     - Общая сумма потраченого хранится в totalSpent
//     - Сумма текущего платежа хранится в переменной payment
//     - скидка хранится discount
    
//     - Если потрачено от[100 - 1000)999, бронзовый партнер скидка 2 %
//     - Если потрачено от[1000 - 5000)4999, серебряный партнер скидка 5 %
//     - Если потрачено больше  5000 золотой партнер скидка 10 %
//     - Если потрачено меньше 100 не партнер скидка 0 %
        
//     В результате вывести сообщение
//    "Оформляем заказ на сумму __ со скидкой__ %"
// let totalSpent = 100000;
// let payment = 500;
// let discount = 0;

// if (totalSpent >= 100 && totalSpent < 1000) {
//     console.log('Бронзовый партнер, скидка 2%');
//     discount = 0.02;
// } else if (totalSpent >= 1000 && totalSpent < 5000) {
//     console.log('Серебряный партнер, скидка 5%');
//     discount = 0.05;
// } else  if (totalSpent >= 5000){
//     console.log('Золотой партнер, скидка 10%');
//     discount = 0.1
// } else {
//     console.log('Не партнер, скидка 0%');
// }
// payment -= payment * discount;
// // payment = payment - payment * discount
// console.log(`Оформляем заказ на сумму ${payment} со скидкой ${discount * 100}%`);
// totalSpent += payment;
// console.log(`Общая сумма потрачена в магазине ${totalSpent}`);

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


// //Скрипт введення кількості

// const btnAdd = document.querySelector('button[data-add]');
// const btnReset = document.querySelector('button[data-reset]')
// const valueInput = document.querySelector('input[data-value]');
// const outputEl = document.querySelector('.js-output span');


// console.log(btnAdd);
// console.log(valueInput);

// let total = 0;

// btnAdd.textContent = 'додати';
// btnAdd.addEventListener ('click', function () {
//     console.log('отримали');
//     const value = Number(valueInput.value);

//     console.log(value);

//     total += value;
//     outputEl.textContent = total;
//     valueInput.value = '';
// })
// btnReset.addEventListener('click', function () {
//     total = 0;
//     outputEl.textContent = total;
// })
//  __________________________________________________________________________________________
// Дані
// //глобальні
// const a = 15;
// console.log(a);

// блочні
// const a = 10;
// if (true) {
//     console.log(a);
// }
// ////10
// if (true) {
//     const b = 22;
// }
// console.log(b);
////10-error в блок не може попости і показати зміну

// функціональна
// const a = 14;
// function foo() {
//     console.log(a);
//     const b = 22;
// }
// console.log(b);
// ////error

// const a = 10;
// if (true) {
//     console.log(a);
// }
// ////10
// if (true) {
//     var b = 22;
// }
// console.log(b);
// // //var виходить за межі блока, тому ерор змінюється на число var, а якщо вар оголосимо в середині функції то буде ерор, це додатковий блок

// приклади
// ____________________________________________
// 1.
// let a = 15;
// if (true) {
//     a = 10;
// }
// console.log(a);
//// 10 //// а вийшло з блока
// _____________________________________
// let a = 15;
// if (true) {
//     let a = 1;
//     a = 10;
// }
// console.log(a);
//// 15// змінна а не бачить що робиться в блоці
// ___________________________________________
// let a = 15;
// if (true) {
//     ////звернення до ініціалізації
//     a = 25;
//     let a = 1;
// }
// console.log(a);
// ////error// джава виконується  все в одному потоці, якщо є помилка то далі весь код приривається, ось чому еррор
// ______________________________________________
// let a = 10;
// if (true) {
//     let a = 15;
//     if (true) {
//         a = 5;
//     }
// }
// console.log(a);
////10////
////перевизначення не піднялося в глобальну область видимості  тому змінна а залишилась 10
// __________________________________________________
// let a = 10;
// if (true) {
//      a = 15;
//     if (true) {
//         a = 25;
//     }
// }
// console.log(a);
////25////
// ___________________________________________________________
// let a = 10;
// if (true) {
//     a = 15;
//     if (true) {
//      let a = 25;
//     }
// }
// console.log(a);
// //15//
// ___________________________________________________________
// let b = 25;
// if (true) {
//     let a = 15;
//     b = 44;
//     if (true) {
//         a = 25;
//         b = 31;
//     }
//     a = 44;
//     console.log(b);
// }
// console.log(a);
////31//error- змінна б перевизначена до 31, змінна а замкнута в середині блока тому еррор
// ________________________________________________________________

// *********************************************
//     Цикли
// *********************************************
// for (let i = 0; i < 5; i += 1)
// {
//     console.log(i);
// }
// const str = 'Hello world';
// for (let i = 0; i < str.length; i+=1) {
//     console.log(str[1]);
// }

// Аналог через While, вже майже не використовується
// const str = 'Hello world';
// let i = 0;
// while (i < str.length) {
//     if (str[i] === 'w'){
//         console.log('yes');
//         break;
//     }
//     i += 1;
//     console.log('no', str[i]);
// }

// const str = 'Hello world';
// let i = 0;
// do {
//     if (str[i] === 'w') {
//         console.log('yes');
//         break;
//     }
//     console.log('no');
//     i += 1;
// } while (i < str.length);

// ________________________________________________________________
// Завдання 1 Введення користувача та розгалудження

// Використовуючи конструкцію иф елсе та промт, напиши код, який питатиме: "Яка офіційна назва JavaScript?". Якщо користувач вводить ECMAScript, то показуй Алертз рядком "Правильно!", в іншому випадку "Не знаєте ECMAScript!"

// const value = prompt('Яка офіційна назва JavaScript?');
// console.log(value);
// if (value === 'ECMAScript') {
//     alert('Правильно!')
// } else {
//     alert('Не знаєте ECMAScript!')
// }
// console.log(value);
// _____________________________________________________________
// Завдання 2 Напиши скрипт для відображення годин ьа хвилин у консолі браузера у вигляді рядка формату "14 г. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14г.", без хвилин

// const hours = 14;
// const minutes = 2;
// let timesting;

// if (minutes) {
//     console.log(`${hours} г. ${minutes} хв.`);
// } else {
//     console.log(`${hours} г.`);
// }
// ______________________________________________________________
// Завдання 2 - Розгалудження
// Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у Промпт користувач ввів число більше нуля. Якщо було введено нуль, виводь в коенсоль рядок "Це нуль", Якщо передали від'ємне число, рядок "Це негативне число"

// const userInput = Number(prompt('Введіть число'));
// console.log(typeof userInput);
// if (!userInput) {
//     console.log("Це нуль");
// } else if (userInput > 0 ) {
//     console.log("Це позитивне число");
// }else {
//     console.log("Це негативне число");
// }
// **********************************************
// const userInput = Number(prompt('Введіть число'));
// if (userInput % 2) {
//     console.log("Не парне");
// } else {
//     console.log("Парне");
// }
////Тернарний вираз
// console.log(userInput % 2 ? "Не парне" : "Парне");

// **************************************************************

// Завдання 4 Вкладені розгалудження
// Напиши скрипт, який порівнює числа у змінних a та b. Якщо обидва значення більше 100, то виведи в консоль максимальне з них. В протилежному  випадку в консолі повинна бути сума значення b та числа 512

// const a = 10;
// const b = 180;
// if (a > 100 && b > 100) {
//     if (a > b) {
//         console.log(a);
//     } else {
//         console.log(b);
//     }
// } else {
//     console.log(b + 512);
// }
// переписуємо на тернарку
// const a = 45;
// const b = 180;
// if (a > 100 && b > 100) {
//     console.log(a > b ? a : b );
// } else {
//    console.log(b + 512);
// }
// ___________________________________________________________
// Завдання 5 - Форматування посилання(endsWith)
// Напиши скрипт який перевіряє чи закінчується значення змінної Лінк символом /. Якщо ні, додай до кінця значення Лінк цей символ. Використовуй конструкцію иф..елсе.

// let link = 'https://my-site.com/about';
// if (!link.endsWith("/")) {
//     link += '/';
// }
// console.log(link);

// _______________________________________________________
// Завдання 6 - Форматування посилання(includes та логічна "І")
// Напиши скрипт який перевіряє чи закінчується значення змінної Лінк символом /. Якщо ні, додай до кінця значення лінк цей символ, але тільки в тому випадку , якщо в лінк є підрядок "my-site". Використовуй конструкцію иф..елсе.

// let link = 'https://my-site.com/about';
// if (!link.endsWith("/") && link.includes("my-site")) {
//     link += '/';
// }
// console.log(link);

// ____________________________________________________________

// Завдання 7 - Форматування посилання тернарним оператором
// виконай рефакторинг коду завдання 6
// let link = 'https://my-site.com/about';
// console.log(link.includes("my-site") && !link.endsWith('/') ? link+= '/' : link);

// ______________________________________________________
// Завдання 8 - иф..елсе.та логічні оператори
// Напиши скрипт який виводить в консоль браузера рядок в залежності від значення змінної hours
// Якщо значення змінної hours:
// менше 17, виводить рядок "Pending"
// більше або дорівнює 17 і менше або дорівнює 24, рядок "Expires"
// більше 24 , рядок "Overdue"

// const hours = 18;
// if (hours < 17) {
//     console.log("Pending");
// } else if(hours >=17 && hours <= 24){
//     console.log("Expires");
// }else {
//     console.log("Overdue");
// }
// _____________________________________________________________
// Завдання 9 - Дедлайн здачі проекту иф..елсе.Напиши скрипт для відображення дедлайну здачі проекту.
// Якщо 0 днів - рядок "Сьогодні!"
// Якщо 1 день - "Завтра!"
// 2 дні - "Післязавтра!"
// 3 дні -  "Дата у мабутньому"
//
// const dayUntilDeadLine = 0;
// if (!dayUntilDeadLine) {
//     console.log("Сьогодні!");
// } else if (dayUntilDeadLine === 1){
//     console.log("Завтра!");
// } else if (dayUntilDeadLine === 2){
//     console.log("Післязавтра!");
// } else {
//     console.log("Дата у мабутньому");
// }
//// переписуємо на свіч
// const dayUntilDeadLine = 0;
// if (dayUntilDeadLine >= 0) {
//     switch (dayUntilDeadLine) {
//     case 0:
//         console.log("Сьогодні!");
//         break;
//     case 1:
//         console.log("Завтра!");
//         break;
//     case 2:
//         console.log("Післязавтра!");
//         break;

//     default:
//         console.log("Дата у мабутньому");
//         break;
// }
// } else {
//     console.log('Друже ти проспав');
// }
// ______________________________________________________
// Завдання 11 - цикли фор
// Напиши фор який виводить у консоль браузера числа за зростанням від мін до макс, але якщо число кратне 5
// const max = 100;
// const min = 20;
// for (let i = min; i >= min && i <= max; i+=1) {
//     if (!(i % 5)) {
//        console.log(i);
//     }
// }

// ___________________________________________________________
// Завдання 12 -Введення користувача та розгалудження
// Напиши скрипт, який питатиме логін за допомогою промпт та логувати результат у консоль браузера
// Якщо відвідувач вводить адмін, то промт запитує пароль
// Якщо нічого не введено або натиснуто ескейп - вивести рядок "Скасовано"
// В іншому випадку - "Я вас не знаю"
// Пароль перевіряти так:
// Якщо введено пароль "Я адмін", то рядок "Здравствуйте!"
// Інше рядок - "Не вірний пароль!"

// const login = prompt('Тут має бути логін');
//     if (!login){
//         console.log("Скасовано");
//     } else if (login === "адмін") {
//        const password = prompt('Ваш пароль')
//         console.log(password === "Я адмін" ? "Здравствуйте!" : "Не вірний пароль!");
//     } else {
//         console.log("Я вас не знаю");
//     }


