// __________________________________________________________________________

// const value = 4;
// if (value > 5) {
//     console.log('4>5');
// } else if(value > 6){
//     console.log('4>6');
// } else {
//     console.log('else');
// }

// const value = '';
// if (value) {//0=>false
//     console.log('if');
// } else {
//     console.log('else');
// }

// condition ? example 1 : example 2


// const result  5 > 6 ? 'більше' : 'меньше'
//                          true     false
// Присвой в результат виразу тернарного виразу, якщо 5 більше 6 то
//   присвой рядочок меньше, якщо все ж таки умова буде правдивлою,
//   отримаємо блок тру,більше
// let result;
// if (7 > 6) {
//     result = 'більше';
// } else {
//     result = 'меньше';
// }
// console.log(result);


// const result = 10 + 5;
// console.log(result);
// console.log(testValue);
// const value = 5;
// if (value === 1) {
    
// } else if (value === 2) {
    
// } else if (value === 2) {

// } else if (value === 5) {

// } else {
//     console.log('default');
// }

// switch (value) {
//     case 1:
//         console.log('one');
//         break;
//     case 2:
//         console.log('two');
//         break;
//     case 5:
//         console.log('Good result');
//         break;
//     default:
//         console.log('default');
// }
// _________________________________________________________________________
// області видимості - Де замкнена ваша змінна
// 1 Глобальна(повністю весь наш файл)
// 2 блочна У фігурних дужках
// 3 функціональна (в функції)

// блок це будь що замкнене в фігурні дужки

// const a = 15;
// if (true) {
//     console.log(a);
// }
// if (true) {
//     const b = 22;
// }
// console.log(b); //b is not defined- можемо з середини підніматися на зовні

// const a = 15;
// if (true) {
//     console.log(a);
// }
// if (true) {
//     var b = 22;
// }
// console.log(b); //var можна витянути за межі блока, якщо буде в функції
// то буде писати помилку. Функціонал додптково блокує

// Приклад 1
// let a = 15;     //якщо тру то ми змінну перевизначаємо з 15 на 25
// if (true) {     //якщо false то оголошена змінна залишається 15
//     a = 25;
// }
// console.log(a);

// Приклад 2
// let a = 15;     //15 -змінна не побачить що віббувається в блоці
// if (true) {     //тому залишить попередні дані
//     //блочна змінна
//    let a = 1;
//     a = 25;
// }
// console.log(a);

// Приклад 3
// let a = 15;     //глобальна змінна
// if (true) {     //після оголошення глобальної не мложна переоголошувати
//     //блочна змінна
//     a = 25;
//    let a = 1;
// }
// console.log(a);


// let a = 10;
//оголосили глоб змінну, ідемо в іф, оголошенна змінна а,

// if (true) {
//     let a = 15;
//     if (true) {            //10
//         a = 25;
//     }
// }
// console.log(a);

// if (true) {
//     let a = 15;
//     if (true) {            //25
//         a = 25;
//     }
//     console.log(a);
// }

// if (true) {
//      a = 15;
//     if (true) {            //25
//         a = 25;
//     }
// }
// console.log(a);

// let a = 15;

// if (true) {
//      a = 15;
//     if (true) {            //15
//        let a = 25;
//     }
// }
// console.log(a);


// let b = 25;
// if (true) {
//     let a = 15;
//     b = 44;
//     if (true) {            //31
//         a = 25;            //a is not defined
//         b = 31;
//     }
//     a = 44;
//     console.log(b);
// }
// console.log(a);

// ____________________________________________________________________
// ЦИКЛИ
// for (let i = 0; i < 5; i += 1){
//     console.log(i);
// }
// порядковий номер 123456
// const str = 'Hello world';
// // індекс 012345
// for (let i = 0; i < str.length; i += 1){
//     console.log(str[i]); //0123456
// }

// while (true){
//     console.log('Hello world');
// }

// const str = 'hello world';
// let i = 0;
// do {
//     if (str[i] === 'w') {
//         console.log('yes');
//         break;
//     }
//     console.log('no');
//     i += 1;
    
// } while (i < str.length);

// let i = 0;
// while (i < str.length) {
//     if (str[i] === 'w'){
//         console.log('yes');
//         break;
//     }
//     console.log('no', str[i]);
//     i += 1;
// }

// _________________________________________________________________________

// example 1 ВведеннЯ користувача та розгалудження
// Використовуючи конструцію  if.. else та promt напиши код, який питатиме:
// "Яка офіційна назва JavaScript?".Якщо користувач вводить ECMAScript, то показуй
// alert з рядком "Правильно!", в іншому випадку-"Не знаєте? ECMAScript!"

// const value = prompt("Яка офіційна назва JavaScript?");
// if (value === 'ECMAScript') {
//     alert('Правильно!');
// } else {
//     alert("Не знаєте? ECMAScript!")
// }
// console.log(value);
// _______________________________________________________________________________
// Example 2 - Відображення часу(if..else)
// Напиши скриптдля відображення годин та хвилин у консолі браузера у вигляді рядка
// формату "14 г. 26хв.".Якщо значення змінної minutes дорівнює 0, то виводь рядок
// "14г.", без хвилин.

// const hours = 14;
// const minutes = 46;
// let timestring;

// if (minutes) {
//     console.log(`${hours} г. ${minutes} хв.`);
// } else {
//     console.log(`${hours} г.`);
// }
// ____________________________________________________________________________
// Example 3 Розгалудження
// Напиши скрипт, який виводить у консоль рядок
// "Це позитивне число",
// якщо у промпт користувач ввів число більше нуля.Якщо було введено ноль,
// виводить рядок
// "Це нуль".
// Якщо від'ємне число, виводить рядок
// "Це негативне число"

// const userInput = Number(prompt('Введіть число'));
// console.log(typeof userInput);
// if (!userInput) {
//     console.log("Це нуль");
// } else if(userInput > 0){
//     console.log("Це позитивне число");
// } else {
//     console.log("Це негативне число");
// }

// const userInput = Number(prompt('Введіть число'));
// if (userInput % 2) {
//     console.log('Не парне');
// } else {
//     console.log('Парне');
// }
// тернарка
//   console.log(userInput % 2 ? 'Не парне' : 'Парне');
// ___________________________________________________________________________
// Example 4 Вкладені розгалудження
// Напиши скрипт, який порівнює числа у змінних а та Ь.Якщо обидва значення більше 100
// то виведи в консоль максимальне з них. В протилежному випадку у консолі повинна
// бути сумма значення ь та числа 512.
// const a = 852;
// const b = 180;

// if (a > 100 && b > 100) {
//     if (a > b) {
//         console.log(a);
//     } else {
//         console.log(b);
//     }
// } else {
//     console.log(b + 512);
// }

//тернарка
// if (a > 100 && b > 100) {
//     console.log(a > b ? a : b);
// } else {
//     console.log(b + 512);
// }

// ______________________________________________________________________
// Example 5 Форматування посилання(endsWith)
// Напиши скрипт який перевіряє чи закінчується значення змінної
// link символом /.Якщо ні то додай до кінця значення link цей символ.
// Використовуй конструкцію (if..else)
// let link = 'https://my-site.com/about';
// if(!link.endsWith('/')) {
//     link += '/';
// }
// console.log(link);
// _________________________________________________________________________
// Example 6 Форматування посилання(includes та логічна "І")
// Напиши скрипт який перевіряє чи закінчується значення змінної
// link символом /.Якщо ні то додай до кінця значення link цей символ,
// але тільки в тому випадку, якщо в link є підрядок "my-site".
// Використовуй конструкцію (if..else)

// let link = 'https://somesite.com/about';
// if(!link.endsWith('/') && link.includes('my-site')) {
//     link += '/';
// }
// console.log(link);
// ______________________________________________________________________________
// Example 7 Форматування посилання(тернарний оператор)
// Виконай рефакторинг коду задачі номер 7, використовуючи тернарний оператор

// let link = 'https://somesite.com/about';
// if(!link.endsWith('/') && link.includes('my-site')) {
//     link += '/';
// }
// console.log(link.includes('my-site') && !link.endsWith('/') ? link += '/' : link);
// ____________________________________________________________________________
// Example 8 if..else та логічні опертори
// Напиши скрипт який виводить в консоль браузера рядок залежно
// від значення змінної hours
// Якщо значення змінної hours:
// -менше 17, виводить рядок "Pending"очікує
// - більше або дорівнює 17 і менше 24, 'Expires'закінчується
// -більше 24, 'Overdue'прострочено
// const hours = 10;
